app/controllers/firearms_controller.rb

  def index
    @firearms = Firearm.all
---
SELECT * FROM `firearms`

  def show
    @firearm = Firearm.find(params[:id])
---
SELECT * FROM `firearms` WHERE (`firearms`.`id` = 1)

  def create
    @firearm = Firearm.new(params[:firearm])

    respond_to do |format|
      if @firearm.save
---
INSERT INTO `firearms` (`times_fired`, `created_at`, `updated_at`, `last_clean_date`, `caliber`) VALUES(500, '2011-01-24 01:26:37', '2011-01-24 01:26:37', '2011-01-01', '.40')