app/controllers/product_informations_controller.rb

  def index
    @product_informations = ProductInformation.all
---
SELECT * FROM `product_informations`

  def show
    @product_information = ProductInformation.find(params[:id])
---
SELECT * FROM `product_informations` WHERE (`product_informations`.`id` = 1)

  def create
    @product_information = ProductInformation.new(params[:product_information])

    respond_to do |format|
      if @product_information.save
---
INSERT INTO `product_informations` (`brand`, `model`, `serial_number`, `created_at`, `updated_at`) VALUES('Winchester', 'Slugger', '123456', '2011-01-19 03:24:11', '2011-01-19 03:24:11')